// 1. Вам дан массив: [315, 64, 75, 43, 65, 63].Найдите сумму каждого числа.
// let a = [315, 64, 75, 43, 65, 63]
// console.log(a.map((el) => {
//     return el + el
// }));

// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, изменяющую букву а в
//  каждом имени на я и выведите в консоль.
// let a = ['Аскар', 'Баяман', 'Калмамат']
// console.log(a.map((el) => {
//     return el.replaceAll("а","я")
// }));

// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, которая выводит только
//  те имена, где есть буква к и выведите в консоль.
// function task(a){
//  return a.filter((el) => {
//   return  el.includes('К')
// })

// }console.log(task(['Аскар', 'Баяман', 'Калмамат']));

// 4. Вам дан массив: [4, 54, 49]. Сделайте из него массив, состоящий из квадратов этих чисел.
// function task(arr){
//     arr.map((el) => {
//         return el ** 2
//     })
// }console.log(task([4, 54, 49]));
// let arr = [4, 54, 49]
// console.log(arr.map((el) => {
//   return el **2
// }));

// 5. Вам дан массив [3134, 4, -143, -245, -214]. Оставьте в нем только отрицательные числа.
// let arr = [3134, 4, -143, -245, -214]
// console.log(arr.filter((el) => {
//     return el > 0
// }));
// function task(arr){
//     return arr.filter((el) => {
//        return el > 0
//     })
// }console.log(task( [3134, 4, -143, -245, -214]));

// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте в нем только четные числа.
// let a = [3, 51, 30, 54, 60]
// console.log(a.filter((el) => {
//     return el % 2 !== 0
// }));
// function task(arr){
//     return arr.filter((el) =>{
//        return el % 2 === 0
//     })
// }console.log(task([3, 51, 30, 54, 60]));

// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Оставьте в нем только те строки,
//  длина которых больше 5-ти символов.
// let arr = ['Бегимай', 'Баяман', 'Калмамат']
// console.log(arr.filter((el) => {
//     return el.length > 5
// }));
// function task(arr) {
//   return arr.filter((el) => {
//     return el.length > 5;
//   });
// }
// console.log(task(["Бегимай", "Баяман", "Калмамат"]));

// 8. Вам дан массив [-13, 96, -41, -28, 40]. Посчитайте количество отрицательных чисел в этом массиве.
// let a = [-13, 96, -41, -28, 40]
// console.log(a.filter((el) => {
//     return el > 0
// }).length);
// function task(arr){
//     return arr.filter((el) => {
//         return el > 0
//     })
// }console.log(task([-13, 96, -41, -28, 40]).length);

// 9. Вам дан массив [3, 51, -30, -54, 60]. Оставьте в нем только положительные числа. Затем извлеките квадратный корень из этих чисел, если эти числа больше 30.
// let a = [3, 51, -30, -54, 60];
// console.log(
//   a
//     .filter((el) => {
//       return el > 0;
//     })
//     .map((el) => {
//       return Math.sqrt(el);
//     })
// );

// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null]. Создайте функцию, которая очищает массив от ложных (false) значений: false, null, undefined,
//  0, –0, NaN и "" (пустая строка).
//  let arr = [NaN, 0, 77, false, -17, '',undefined, 99, null]
//  console.log(arr.filter((hl) => (hl)) );
 


// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Выведите длину каждой строки.
// let arr = ['Бегимай', 'Баяман', 'Калмамат']
// console.log(arr.map((el) => (el.length)));



// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!




// let arr = [2,4,5,67,8,6]
// let a = arr.concat(["hjkk"] ,["f345678"],[5])
// console.log(a);


//  let = a ["Bilbo", "Gandalf", "Nazgul"].forEach((item, index, array) => {
//     alert(`${item} is at index ${index} in ${array}`);
//   });
// let адамдар = ["Айбек", "Бекжан", "Жанболот"];
// let = a ["Bilbo", "Gandalf", "Nazgul"]
// a.forEach((item, index, array) => {
//     console.log(`${item} is at index ${index} in ${array}`);
// })
// let адамдар = ["Айбек", "Бекжан", "Жанболот", "rtyuio"];

// адамдар.forEach((item, index) => {
//   console.log(`${item} индехс ${index} турат.`);
// });
// let адамдар = ["Айбек", "Бекжан", "Жанболот", "Алмас"];

// let result = адамдар.find(function(item) {
//   return item.length > 6;  // Узундугу 6дан көп болгон биринчи эле адамды табабыз
// });

// console.log(result);  // Натыйжа: "Бекжан"
// let users = [
//     {id: 1, name: "John"},
//     {id: 2, name: "Pete"},
//     {id: 3, name: "Mary"}
//   ];
  
//   let user = users.find(item => item.id == 1);
  
//   alert(user.name);  // John
// findIndex() методу find() методу менен окшош, бирок ал кайтарган натыйжа катары элементтин ордун (индексин) кайтарат. Эгерде шартка ылайык келген элемент жок болсо, -1 кайтарылат.

// javascript
// Копировать код
// let users = [
//   {id: 1, name: "John"},
//   {id: 2, name: "Pete"},
//   {id: 3, name: "Mary"}
// ];

// let index = users.findIndex(item => item.id == 1);

// alert(index);  // 0
// К
  // [
  //   {id: 1, name: "John", age: 28, isAdult: true},
  //   {id: 2, name: "Pete", age: 33, isAdult: true},
  //   {id: 3, name: "Mary", age: 22, isAdult: true}
  // ]
//   let str = "Hello";
// console.log(str.length);
// let fruits = ["Apple", "Orange", "Plum"];

// alert( fruits[0] ); // Apple
// alert( fruits[1] ); // Orange
// alert( fruits[2] ); // Plum
// let fruits = []; // make an array
// fruits[99999] = 5; // assign a property with the index far greater than its length
// // fruits.age = 25; // create a property with an arbitrary namelet fruits = [];
// fruits[123] = "Apple";
// alert( fruits.length ); // 124ъъ
// let arr = [8, 2, 3];
// console.log('0' == ['0']);
// console.log("0" == [0]);
// console.log("2" === 2);

// function task(a,b){
//   if(a > b) return "1";
//   if(a === b) return "2";
//   if(a < b) return" 3";
// }console.log(task("1","5"));
// -------------------------------------------------------------------------------------------------------------------------------------------------------------
// Во всех задачах используйте только методы map, filter.

// 1. Вам дан массив: [315, 64, 75, 43, 65, 63].Найдите сумму каждого числа.
// let a = [315, 64, 75, 43, 65, 63]
// console.log(a.map((el) => {
//   return el + el
// }));

// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, изменяющую букву а в каждом имени на я и выведите в консоль.
let a = ['Аскар', 'Баяман', 'Калмамат']
console.log(a.map((el) => (a)));

// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, которая выводит только те имена, где есть буква к и выведите в консоль.
// 4. Вам дан массив: [4, 54, 49]. Сделайте из него массив, состоящий из квадратов этих чисел.
// 5. Вам дан массив [3134, 4, -143, -245, -214]. Оставьте в нем только отрицательные числа.
// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте в нем только четные числа.
// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
// 8. Вам дан массив [-13, 96, -41, -28, 40]. Посчитайте количество отрицательных чисел в этом массиве.
// 9. Вам дан массив [3, 51, -30, -54, 60]. Оставьте в нем только положительные числа. Затем извлеките квадратный корень из этих чисел, если эти числа больше 30.
// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null]. Создайте функцию, которая очищает массив от ложных (false) значений: false, null, undefined, 0, –0, NaN и "" (пустая строка).
// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Выведите длину каждой строки.