// Давайте попробуем 5 операций с массивами.

// Создайте массив stylesс элементами «Джаз» и «Блюз».
// Добавьте в конец «Рок-н-ролл».
// Замените значение в середине на «Classics». Ваш код для поиска среднего значения должен работать для любых массивов нечетной длины.
// Удалите первое значение массива и покажите его.
// Добавить Rapи Reggaeв начало массива.
// let styles = ['Джаз','Блюз']
// styles.push('Рок-н-ролл')
// styles.splice(1,1,'Classics')
// let = Math.floor(styles.length / 2);
// styles.splice(0,1,'Rapи Reggaeв')
// console.log(styles);
